Conceitos Basicos de Pandas

4 - Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']

minha_lista = [10,20,30]

arr = np.array([10,20,30])

d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(labels)

0    a
1    b
2    c
dtype: str

In [4]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: str

In [5]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: str

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1,2,3,4], index = ['EUA', 'Alemanha', 'Rússia', 'Japão'])

In [8]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4], index = ['EUA', 'Alemanha', 'Italia', 'Japão'])

In [10]:
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [11]:
ser1[['Alemanha', 'Rússia']]

Alemanha    2
Rússia      3
dtype: int64

In [12]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Rússia      NaN
dtype: float64

5 - DataFrames e manipulação de colunas

In [13]:
from numpy.random import randn

In [14]:
df = pd.DataFrame(randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109
E  0.764032 -2.341090  0.517197 -1.383297

In [16]:
type(df)

pandas.DataFrame

In [17]:
df['W']

A    1.429763
B   -0.274904
C   -1.119688
D   -1.366736
E    0.764032
Name: W, dtype: float64

In [18]:
df[['W']]

          W
A  1.429763
B -0.274904
C -1.119688
D -1.366736
E  0.764032

In [19]:
df['new'] = df['W']

In [20]:
df

          W         X         Y         Z       new
A  1.429763 -0.550828  1.136228  0.637907  1.429763
B -0.274904  0.168059 -0.632956 -1.502020 -0.274904
C -1.119688 -1.829654 -0.352052  0.861888 -1.119688
D -1.366736  1.015951  1.202301  0.412109 -1.366736
E  0.764032 -2.341090  0.517197 -1.383297  0.764032

In [21]:
df['new'] = df['W'] + df['Z']

In [22]:
df

          W         X         Y         Z       new
A  1.429763 -0.550828  1.136228  0.637907  2.067670
B -0.274904  0.168059 -0.632956 -1.502020 -1.776924
C -1.119688 -1.829654 -0.352052  0.861888 -0.257800
D -1.366736  1.015951  1.202301  0.412109 -0.954628
E  0.764032 -2.341090  0.517197 -1.383297 -0.619265

In [23]:
df2 = df.drop('new', axis=1)

In [24]:
df2

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109
E  0.764032 -2.341090  0.517197 -1.383297

In [25]:
df.drop('new', axis=1, inplace=True)

In [26]:
df

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109
E  0.764032 -2.341090  0.517197 -1.383297

In [27]:
df.loc['A']

W    1.429763
X   -0.550828
Y    1.136228
Z    0.637907
Name: A, dtype: float64

In [28]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020

In [29]:
df.iloc[0, 2]

np.float64(1.136228402655645)

Índices Filtros e Groupby

6 - Iloc e Filtros

In [30]:
df.loc[['A', 'B'], ['W']]

          W
A  1.429763
B -0.274904

In [31]:
df.iloc[:-1,1:]

          X         Y         Z
A -0.550828  1.136228  0.637907
B  0.168059 -0.632956 -1.502020
C -1.829654 -0.352052  0.861888
D  1.015951  1.202301  0.412109

In [32]:
df.iloc[1:4,1:3]

          X         Y
B  0.168059 -0.632956
C -1.829654 -0.352052
D  1.015951  1.202301

In [33]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C  False  False  False   True
D  False   True   True   True
E   True  False   True  False

In [34]:
df

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109
E  0.764032 -2.341090  0.517197 -1.383297

In [35]:
df[df > 0]

          W         X         Y         Z
A  1.429763       NaN  1.136228  0.637907
B       NaN  0.168059       NaN       NaN
C       NaN       NaN       NaN  0.861888
D       NaN  1.015951  1.202301  0.412109
E  0.764032       NaN  0.517197       NaN

In [36]:
df[df['Z'] > 0]

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109

In [37]:
df[(df['Z'] > 0) & (df['W'] > 0)]

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907

Operações com índices

In [38]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='str')

In [39]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='str')

In [40]:
df

          W         X         Y         Z
A  1.429763 -0.550828  1.136228  0.637907
B -0.274904  0.168059 -0.632956 -1.502020
C -1.119688 -1.829654 -0.352052  0.861888
D -1.366736  1.015951  1.202301  0.412109
E  0.764032 -2.341090  0.517197 -1.383297

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.429763 -0.550828  1.136228  0.637907
1     B -0.274904  0.168059 -0.632956 -1.502020
2     C -1.119688 -1.829654 -0.352052  0.861888
3     D -1.366736  1.015951  1.202301  0.412109
4     E  0.764032 -2.341090  0.517197 -1.383297

In [42]:
df.reset_index(inplace=True)

In [43]:
df

  index         W         X         Y         Z
0     A  1.429763 -0.550828  1.136228  0.637907
1     B -0.274904  0.168059 -0.632956 -1.502020
2     C -1.119688 -1.829654 -0.352052  0.861888
3     D -1.366736  1.015951  1.202301  0.412109
4     E  0.764032 -2.341090  0.517197 -1.383297

In [44]:
df.set_index('index')

              W         X         Y         Z
index
A      1.429763 -0.550828  1.136228  0.637907
B     -0.274904  0.168059 -0.632956 -1.502020
C     -1.119688 -1.829654 -0.352052  0.861888
D     -1.366736  1.015951  1.202301  0.412109
E      0.764032 -2.341090  0.517197 -1.383297

In [45]:
df.set_index('index', inplace=True)

In [46]:
df

              W         X         Y         Z
index
A      1.429763 -0.550828  1.136228  0.637907
B     -0.274904  0.168059 -0.632956 -1.502020
C     -1.119688 -1.829654 -0.352052  0.861888
D     -1.366736  1.015951  1.202301  0.412109
E      0.764032 -2.341090  0.517197 -1.383297

In [47]:
novoind = 'CA NY WY OC CO'.split()

In [48]:
novoind

['CA', 'NY', 'WY', 'OC', 'CO']

In [49]:
df['novo_index'] = novoind

In [50]:
df.reset_index().set_index('novo_index')

           index         W         X         Y         Z
novo_index
CA             A  1.429763 -0.550828  1.136228  0.637907
NY             B -0.274904  0.168059 -0.632956 -1.502020
WY             C -1.119688 -1.829654 -0.352052  0.861888
OC             D -1.366736  1.015951  1.202301  0.412109
CO             E  0.764032 -2.341090  0.517197 -1.383297

Índices multiníveis

In [51]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [52]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [53]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [54]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1 -0.022118 -0.807068
   2 -0.591433  0.284428
   3 -0.958329  0.942690
G2 1 -0.099649  0.124634
   2  1.222427  1.943695
   3  1.491619  0.079756

In [56]:
df.loc['G1']

          A         B
1 -0.022118 -0.807068
2 -0.591433  0.284428
3 -0.958329  0.942690

In [57]:
df.loc['G1'].loc[1]

A   -0.022118
B   -0.807068
Name: 1, dtype: float64

In [58]:
df.index.names = ['Grupo', 'Numero']
df

                     A         B
Grupo Numero
G1    1      -0.022118 -0.807068
      2      -0.591433  0.284428
      3      -0.958329  0.942690
G2    1      -0.099649  0.124634
      2       1.222427  1.943695
      3       1.491619  0.079756

In [59]:
df.xs(1, level='Numero')

              A         B
Grupo
G1    -0.022118 -0.807068
G2    -0.099649  0.124634

Tratamento de dados ausentes

In [60]:
df = pd.DataFrame({'A': [1,2,np.nan],
                  'B': [5,np.nan,np.nan],
                  'C': [1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [61]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [62]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [63]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [64]:
df.fillna('zero')

      A     B  C
0   1.0   5.0  1
1   2.0  zero  2
2  zero  zero  3

In [65]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [66]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [67]:
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Groupby

In [68]:
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
       'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
       'Venda':[200,120,340,124,243,350]}

In [69]:
df = pd.DataFrame(data)

In [70]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [71]:
group = df.groupby('Classe')

In [72]:
group['Venda'].sum()

Classe
Júnior    320
Pleno     464
Sênior    593
Name: Venda, dtype: int64

In [73]:
group['Venda'].mean()

Classe
Júnior    160.0
Pleno     232.0
Sênior    296.5
Name: Venda, dtype: float64

In [74]:
group.min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [75]:
group.max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [76]:
df2 = df

In [77]:
df2['Venda'] = [150,20,333,425,252,643]

In [78]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos     20
2   Pleno   Roberta    333
3   Pleno  Patrícia    425
4  Sênior     Bruno    252
5  Sênior      Vera    643

In [79]:
df3 = pd.concat([df , df2])

In [80]:
df3

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos     20
2   Pleno   Roberta    333
3   Pleno  Patrícia    425
4  Sênior     Bruno    252
5  Sênior      Vera    643
0  Júnior     Jorge    150
1  Júnior    Carlos     20
2   Pleno   Roberta    333
3   Pleno  Patrícia    425
4  Sênior     Bruno    252
5  Sênior      Vera    643

In [81]:
df3.groupby(['Classe', 'Nome']).sum()

                 Venda
Classe Nome
Júnior Carlos       40
       Jorge       300
Pleno  Patrícia    850
       Roberta     666
Sênior Bruno       504
       Vera       1286

Merge, Concat, Join

In [82]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [83]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [84]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [85]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [86]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [87]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [88]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [89]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [90]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [91]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [92]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [93]:
pd.merge(esquerda, direita, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [94]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [95]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [96]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [97]:
pd.merge(esquerda, direita, on=['key1','key2'] )

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [98]:
pd.merge(esquerda, direita, how='outer' ,on=['key1','key2']).fillna('0')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K0   K1  A1  B1   0   0
2   K1   K0  A2  B2  C1  D1
3   K1   K0  A2  B2  C2  D2
4   K2   K0   0   0  C3  D3
5   K2   K1  A3  B3   0   0

In [99]:
pd.merge(esquerda, direita, how='left' ,on=['key1','key2']).fillna('0')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K0   K1  A1  B1   0   0
2   K1   K0  A2  B2  C1  D1
3   K1   K0  A2  B2  C2  D2
4   K2   K1  A3  B3   0   0

In [100]:
pd.merge(esquerda, direita, how='right' ,on=['key1','key2']).fillna('0')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2
3   K2   K0   0   0  C3  D3

In [101]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [102]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

Operações com DataFrames

In [103]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [104]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      str
dtypes: int64(2), str(1)
memory usage: 228.0 bytes

In [105]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [106]:
df['col2'].unique()

array([444, 555, 666])

In [107]:
df['col2'].nunique()

3

In [108]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [109]:
def comp(x):
    return x ** 2 + 3

In [110]:
df['col1_calc'] = df['col1'].apply(comp)

In [111]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [112]:
df['col1'].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [113]:
df['col1'].sum()

np.int64(10)

In [114]:
df['col1'].mean()

np.float64(2.5)

In [115]:
df['col1'].product()

np.int64(24)

In [116]:
df['col1'].std()

np.float64(1.2909944487358056)

In [117]:
df['col1'].max()

np.int64(4)

In [118]:
df['col1'].min()

np.int64(1)

In [119]:
df['col1'].idxmax()

3

In [120]:
df[df['col2'] == 444]

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [121]:
df[df['col2'] == 444]['col1'].sum()

np.int64(5)

In [122]:
df.sort_values(by='col2')

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

In [123]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [124]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [125]:
dict_map = {'one': '1', 'two': '2'}

In [126]:
df['E'] = df['B'].map(dict_map)

In [127]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [128]:
df.pivot_table(index='A', columns='B', values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

Séries temporais

In [129]:
numero_de_dias = 100

In [130]:
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)

In [131]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[us]', freq='D')

In [132]:
df = pd.DataFrame(range(numero_de_dias), columns=['number'], index=datas)

In [133]:
df

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [134]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[us]', freq='D')

In [135]:
df.index[0]

Timestamp('2021-01-01 00:00:00')

In [136]:
df.index[0].day

1

In [137]:
df.index[0].month

1

In [138]:
df.index[0].year

2021

In [139]:
df.index[0].hour

0

In [140]:
df[df.index.month == 1]

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
2021-01-06       5
2021-01-07       6
2021-01-08       7
2021-01-09       8
2021-01-10       9
2021-01-11      10
2021-01-12      11
2021-01-13      12
2021-01-14      13
2021-01-15      14
2021-01-16      15
2021-01-17      16
2021-01-18      17
2021-01-19      18
2021-01-20      19
2021-01-21      20
2021-01-22      21
2021-01-23      22
2021-01-24      23
2021-01-25      24
2021-01-26      25
2021-01-27      26
2021-01-28      27
2021-01-29      28
2021-01-30      29
2021-01-31      30

In [141]:
df[df.index.day == 10]

            number
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [142]:
df['month'] = df.index.month

In [143]:
df

            number  month
2021-01-01       0      1
2021-01-02       1      1
2021-01-03       2      1
2021-01-04       3      1
2021-01-05       4      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[100 rows x 2 columns]

In [144]:
import datetime

In [145]:
df[df.index > datetime.datetime(2021,1,10)]

            number  month
2021-01-11      10      1
2021-01-12      11      1
2021-01-13      12      1
2021-01-14      13      1
2021-01-15      14      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[90 rows x 2 columns]

Entrada e saída de dados

In [146]:
df1 = pd.read_csv("Apostila - Analisando Dados com Pandas & SQL/Analisando Dados com Pandas & SQL/Dataserts/exemplo.csv",
                  sep=',',
                  decimal='.')

In [147]:
df1

          0         1         2         3
0 -0.394813 -0.694630  0.253393  0.602590
1 -2.134217  1.141381 -0.130142  0.690936
2 -0.223754  0.365133 -0.104233 -0.182788
3  0.108066  0.331332  0.053708 -0.280468
4  0.085290  0.740834 -0.596941  0.243950

In [148]:
df1.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 292.0 bytes

In [149]:
df1.to_csv('exemplo2.csv', sep=';', decimal=',')